---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod.Projection
enum: Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod
source: html/28fcae11-78b7-c34b-d307-20055e71a26e.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod.Projection

Manually set projections for analytical model using projection parameters.